app/views/contigs/_form.html.erb

SELECT "markers".* FROM "markers"
---

            <%= f.collection_select(:marker_id, Marker.all, :id, :name, include_blank: true) %>

SELECT "primer_reads".* FROM "primer_reads" WHERE "primer_reads"."contig_id" = $1 AND (used_for_con = 't' AND assembled = 't')  [["contig_id", 12297]]
SELECT COUNT(*) FROM "primer_reads" WHERE "primer_reads"."contig_id" = $1 AND (used_for_con = 't' AND assembled = 't')  [["contig_id", 12297]]
---

        <% if @contig.primer_reads.count > 0 %>

SELECT "partial_cons".* FROM "partial_cons" WHERE "partial_cons"."contig_id" = $1  [["contig_id", 12297]]
SELECT "primer_reads".* FROM "primer_reads" WHERE "primer_reads"."partial_con_id" = $1  [["partial_con_id", 7020]]
---

        <% if @contig.primer_reads.assembled.count.positive? || @contig.partial_cons_count&.positive? %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
                      <%begin%>
                          <%user= User.find(@contig.verified_by).name %>