app/views/contigs/_form.html.erb

          <!-- list/ling included reads -->
          <% assembled=@contig.primer_reads.where("used_for_con = ? AND assembled = ?", true, true) %>
---
SELECT "primer_reads".* FROM "primer_reads" WHERE "primer_reads"."contig_id" = $1 AND (used_for_con = 't' AND assembled = 't')

          <!-- not to be used -->
          <% dontuse=@contig.primer_reads.where(:used_for_con => false) %>
---
SELECT "primer_reads".* FROM "primer_reads" WHERE "primer_reads"."contig_id" = $1 AND "primer_reads"."used_for_con" = 'f'