app/views/contigs/index.html.erb

<p>
 Assembly complete for <%= Contig.where(:assembled => true).count %> contigs.
</p>
---
SELECT COUNT(*) FROM "contigs" WHERE "contigs"."assembled" = 't'