app/views/home/search.html.erb

SELECT "higher_order_taxons".* FROM "higher_order_taxons"
---
      <tbody>
      <% for t in HigherOrderTaxon.all.order('higher_order_taxa.position') %>

SELECT "markers".* FROM "markers"
---
            <td><%= Contig.where(marker_id: m.id).count %></td>
            <td><%= m.marker_sequences.count %></td>