app/controllers/contigs_controller.rb

SELECT "contigs".* FROM "contigs"
---
  def index
    @contigs = Contig.all

SELECT  "contigs".* FROM "contigs" WHERE "contigs"."id" = $1 LIMIT 1
---
  def set_contig
    @contig = Contig.find(params[:id])