app/controllers/contigs_controller.rb

  def set_contig
    @contig = Contig.includes(:isolate =>  :individual).find(params[:id])
---
SELECT  "isolates".* FROM "isolates" WHERE "isolates"."id" = $1 LIMIT 1  [["id", 10425]]