app/controllers/primer_reads_controller.rb

  def set_primer_read
    @primer_read = PrimerRead.includes(:contig => { :isolate => :individual }).find(params[:id])
---
SELECT  "contigs".* FROM "contigs" WHERE "contigs"."id" = $1 LIMIT 1  [["id", 12297]]
SELECT  "primer_reads".* FROM "primer_reads" WHERE "primer_reads"."id" = $1 LIMIT 1  [["id", 8449]]