app/controllers/species_controller.rb

  def index
    @species = Species.includes(:family).all
---
SELECT "families".* FROM "families" WHERE "families"."id" IN (68, 74, 129, 69, 70, 71, 72, 73, 84, 75, 76, 8, 77, 88, 79, 67, 25, 80, 81, 82, 83, 85, 86, 10, 11, 12, 28, 14, 18, 15, 16, 17, 19, 20, 21, 22, 130, 65, 23, 24, 26, 27, 29, 30, 31, 60, 35, 32, 33, 34, 41, 36, 37, 38, 40, 185, 42, 43, 52, 44, 45, 47, 48, 49, 51, 53, 54, 55, 56, 57, 58, 59, 135, 61, 62, 63, 64, 66, 9, 39, 46, 50, 131, 132, 133, 134, 136, 137, 138, 139, 140, 6, 7, 90, 91, 92, 171, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 113, 112, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 173, 141, 125, 126, 127, 128, 156, 144, 145, 174, 147, 146, 149, 148, 162, 150, 142, 151, 152, 153, 154, 155, 157, 163, 158, 164, 181, 175, 184, 178, 177, 165, 179, 180, 182, 183, 186, 176, 168, 166, 169, 167, 172, 170, 187)
SELECT "species".* FROM "species"